Res-firecracker-set-v66/firecracker_t_4_c_6_frontVcpu_2_wrkVcpu_2/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 5007.804ms, rate sampling interval: 17514ms
  Thread calibration: mean lat.: 5061.711ms, rate sampling interval: 17989ms
  Thread calibration: mean lat.: 5201.903ms, rate sampling interval: 18038ms
  Thread calibration: mean lat.: 4557.381ms, rate sampling interval: 14204ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    19.02s    12.25s    0.94m    82.50%
    Req/Sec   242.00      2.21   245.00     88.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.27s 
 75.000%   20.69s 
 90.000%   40.21s 
 99.000%    0.94m 
 99.900%    0.97m 
 99.990%    0.98m 
 99.999%    0.98m 
100.000%    0.98m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6053.887     0.000000            2         1.00
    7544.831     0.100000         4863         1.11
    8601.599     0.200000         9705         1.25
   12918.783     0.300000        14561         1.43
   14475.263     0.400000        19437         1.67
   15269.887     0.500000        24297         2.00
   15826.943     0.550000        26698         2.22
   19103.743     0.600000        29115         2.50
   19775.487     0.650000        31545         2.86
   20234.239     0.700000        33997         3.33
   20692.991     0.750000        36443         4.00
   20922.367     0.775000        37666         4.44
   21282.815     0.800000        38817         5.00
   25018.367     0.825000        40027         5.71
   30081.023     0.850000        41239         6.67
   35160.063     0.875000        42455         8.00
   37683.199     0.887500        43061         8.89
   40206.335     0.900000        43669        10.00
   42663.935     0.912500        44275        11.43
   44564.479     0.925000        44878        13.33
   46727.167     0.937500        45484        16.00
   47808.511     0.943750        45789        17.78
   49151.999     0.950000        46094        20.00
   50397.183     0.956250        46395        22.86
   51675.135     0.962500        46715        26.67
   52723.711     0.968750        47008        32.00
   53280.767     0.971875        47152        35.56
   53903.359     0.975000        47309        40.00
   54525.951     0.978125        47460        45.71
   55115.775     0.981250        47608        53.33
   55705.599     0.984375        47757        64.00
   55934.975     0.985938        47840        71.11
   56197.119     0.987500        47910        80.00
   56492.031     0.989062        47987        91.43
   56754.175     0.990625        48061       106.67
   57114.623     0.992188        48140       128.00
   57278.463     0.992969        48177       142.22
   57409.535     0.993750        48212       160.00
   57573.375     0.994531        48257       182.86
   57737.215     0.995313        48294       213.33
   57901.055     0.996094        48334       256.00
   57966.591     0.996484        48350       284.44
   58032.127     0.996875        48366       320.00
   58097.663     0.997266        48386       365.71
   58163.199     0.997656        48406       426.67
   58228.735     0.998047        48424       512.00
   58261.503     0.998242        48431       568.89
   58327.039     0.998437        48445       640.00
   58359.807     0.998633        48451       731.43
   58425.343     0.998828        48468       853.33
   58425.343     0.999023        48468      1024.00
   58490.879     0.999121        48478      1137.78
   58490.879     0.999219        48478      1280.00
   58523.647     0.999316        48484      1462.86
   58556.415     0.999414        48496      1706.67
   58556.415     0.999512        48496      2048.00
   58556.415     0.999561        48496      2275.56
   58589.183     0.999609        48504      2560.00
   58589.183     0.999658        48504      2925.71
   58589.183     0.999707        48504      3413.33
   58589.183     0.999756        48504      4096.00
   58621.951     0.999780        48514      4551.11
   58621.951     0.999805        48514      5120.00
   58621.951     0.999829        48514      5851.43
   58621.951     0.999854        48514      6826.67
   58621.951     0.999878        48514      8192.00
   58621.951     0.999890        48514      9102.22
   58621.951     0.999902        48514     10240.00
   58621.951     0.999915        48514     11702.86
   58621.951     0.999927        48514     13653.33
   58621.951     0.999939        48514     16384.00
   58621.951     0.999945        48514     18204.44
   58621.951     0.999951        48514     20480.00
   58621.951     0.999957        48514     23405.71
   58621.951     0.999963        48514     27306.67
   58621.951     0.999969        48514     32768.00
   58621.951     0.999973        48514     36408.89
   58621.951     0.999976        48514     40960.00
   58621.951     0.999979        48514     46811.43
   58654.719     0.999982        48515     54613.33
   58654.719     1.000000        48515          inf
#[Mean    =    19023.060, StdDeviation   =    12245.273]
#[Max     =    58621.952, Total count    =        48515]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  57881 requests in 1.00m, 23.90MB read
Requests/sec:    964.65
Transfer/sec:    407.88KB